test_result/fio-3.28-4R5J0001-rw-1G-qd4-num1-64K-3000-WT.txt
fio: Any use of blockalign= turns off randommap
fio-3.28-4R5J0001-randwrite-1G-4-1-64K: (g=0): rw=randwrite, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=4
fio-3.28
Starting 1 process
{
  "fio version" : "fio-3.28",
  "timestamp" : 1750685763,
  "timestamp_ms" : 1750685763526,
  "time" : "Mon Jun 23 21:36:03 2025",
  "global options" : {
    "ba" : "192K"
  },
  "jobs" : [
    {
      "jobname" : "fio-3.28-4R5J0001-randwrite-1G-4-1-64K",
      "groupid" : 0,
      "error" : 0,
      "eta" : 2147483647,
      "elapsed" : 2,
      "job options" : {
        "name" : "fio-3.28-4R5J0001-randwrite-1G-4-1-64K",
        "filename" : "/dev/sda",
        "rw" : "randwrite",
        "bs" : "64K",
        "size" : "1G",
        "runtime" : "3000",
        "ioengine" : "libaio",
        "direct" : "1",
        "iodepth" : "4",
        "numjobs" : "1",
        "group_reporting" : "1",
        "ramp_time" : "0"
      },
      "read" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "write" : {
        "io_bytes" : 1073741824,
        "io_kbytes" : 1048576,
        "bw_bytes" : 976128930,
        "bw" : 953250,
        "iops" : 14894.545455,
        "runtime" : 1100,
        "total_ios" : 16384,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 4666,
          "max" : 59740,
          "mean" : 16555.853882,
          "stddev" : 9318.467228,
          "N" : 16384
        },
        "clat_ns" : {
          "min" : 75179,
          "max" : 905831,
          "mean" : 249091.843872,
          "stddev" : 75011.479202,
          "N" : 16384,
          "percentile" : {
            "1.000000" : 90624,
            "5.000000" : 94720,
            "10.000000" : 162816,
            "20.000000" : 207872,
            "30.000000" : 224256,
            "40.000000" : 224256,
            "50.000000" : 232448,
            "60.000000" : 272384,
            "70.000000" : 292864,
            "80.000000" : 313344,
            "90.000000" : 350208,
            "95.000000" : 358400,
            "99.000000" : 391168,
            "99.500000" : 403456,
            "99.900000" : 419840,
            "99.950000" : 518144,
            "99.990000" : 905216
          },
          "bins" : {
            "75264" : 3,
            "80384" : 1,
            "84480" : 10,
            "85504" : 19,
            "86528" : 33,
            "87552" : 52,
            "88576" : 22,
            "89600" : 16,
            "90624" : 14,
            "91648" : 60,
            "92672" : 160,
            "93696" : 316,
            "94720" : 308,
            "95744" : 149,
            "96768" : 93,
            "97792" : 52,
            "98816" : 39,
            "99840" : 54,
            "100864" : 19,
            "101888" : 10,
            "102912" : 5,
            "116224" : 1,
            "125440" : 6,
            "126464" : 9,
            "127488" : 3,
            "128512" : 1,
            "129536" : 1,
            "130560" : 1,
            "132096" : 11,
            "134144" : 5,
            "136192" : 1,
            "140288" : 6,
            "142336" : 8,
            "144384" : 5,
            "146432" : 3,
            "148480" : 2,
            "150528" : 3,
            "152576" : 1,
            "154624" : 1,
            "156672" : 9,
            "158720" : 15,
            "160768" : 43,
            "162816" : 290,
            "164864" : 350,
            "166912" : 34,
            "168960" : 13,
            "171008" : 20,
            "173056" : 19,
            "175104" : 28,
            "177152" : 14,
            "179200" : 9,
            "181248" : 7,
            "183296" : 13,
            "185344" : 188,
            "187392" : 241,
            "189440" : 105,
            "191488" : 32,
            "193536" : 7,
            "195584" : 14,
            "197632" : 10,
            "199680" : 8,
            "201728" : 12,
            "203776" : 37,
            "205824" : 186,
            "207872" : 337,
            "209920" : 64,
            "211968" : 85,
            "214016" : 57,
            "216064" : 58,
            "218112" : 81,
            "220160" : 126,
            "222208" : 345,
            "224256" : 2320,
            "226304" : 1224,
            "228352" : 191,
            "230400" : 85,
            "232448" : 190,
            "234496" : 128,
            "236544" : 75,
            "238592" : 145,
            "240640" : 235,
            "242688" : 364,
            "244736" : 63,
            "246784" : 32,
            "248832" : 22,
            "250880" : 14,
            "252928" : 16,
            "254976" : 27,
            "257024" : 22,
            "259072" : 7,
            "261120" : 25,
            "264192" : 84,
            "268288" : 158,
            "272384" : 94,
            "276480" : 84,
            "280576" : 281,
            "284672" : 760,
            "288768" : 360,
            "292864" : 210,
            "296960" : 107,
            "301056" : 179,
            "305152" : 430,
            "309248" : 580,
            "313344" : 244,
            "317440" : 216,
            "321536" : 107,
            "325632" : 40,
            "329728" : 23,
            "333824" : 222,
            "337920" : 365,
            "342016" : 196,
            "346112" : 236,
            "350208" : 439,
            "354304" : 534,
            "358400" : 296,
            "362496" : 152,
            "366592" : 42,
            "370688" : 47,
            "374784" : 54,
            "378880" : 43,
            "382976" : 30,
            "387072" : 27,
            "391168" : 37,
            "395264" : 34,
            "399360" : 30,
            "403456" : 29,
            "407552" : 16,
            "411648" : 12,
            "415744" : 11,
            "419840" : 16,
            "428032" : 1,
            "432128" : 2,
            "444416" : 2,
            "518144" : 1,
            "593920" : 1,
            "643072" : 3,
            "741376" : 1,
            "798720" : 1,
            "905216" : 2
          }
        },
        "lat_ns" : {
          "min" : 100186,
          "max" : 919176,
          "mean" : 265991.622986,
          "stddev" : 69599.204785,
          "N" : 16384
        },
        "bw_min" : 957952,
        "bw_max" : 960128,
        "bw_agg" : 100.000000,
        "bw_mean" : 959040.000000,
        "bw_dev" : 1538.664356,
        "bw_samples" : 2,
        "iops_min" : 14968,
        "iops_max" : 15002,
        "iops_mean" : 14985.000000,
        "iops_stddev" : 24.041631,
        "iops_samples" : 2
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 1099,
      "usr_cpu" : 10.919017,
      "sys_cpu" : 33.393995,
      "ctx" : 8628,
      "majf" : 0,
      "minf" : 10,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 99.981689,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 8.447266,
        "250" : 49.133301,
        "500" : 42.364502,
        "750" : 0.036621,
        "1000" : 0.018311
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 4,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "sda",
      "read_ios" : 46,
      "write_ios" : 13297,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 4,
      "write_ticks" : 2928,
      "in_queue" : 2932,
      "util" : 90.927625
    }
  ]
}

fio-3.28-4R5J0001-randwrite-1G-4-1-64K: (groupid=0, jobs=1): err= 0: pid=80860: Mon Jun 23 21:36:03 2025
  write: IOPS=14.9k, BW=931MiB/s (976MB/s)(1024MiB/1100msec); 0 zone resets
    slat (nsec): min=4666, max=59740, avg=16555.85, stdev=9318.47
    clat (usec): min=75, max=905, avg=249.09, stdev=75.01
     lat (usec): min=100, max=919, avg=265.99, stdev=69.60
    clat percentiles (usec):
     |  1.00th=[   91],  5.00th=[   95], 10.00th=[  163], 20.00th=[  208],
     | 30.00th=[  225], 40.00th=[  225], 50.00th=[  233], 60.00th=[  273],
     | 70.00th=[  293], 80.00th=[  314], 90.00th=[  351], 95.00th=[  359],
     | 99.00th=[  392], 99.50th=[  404], 99.90th=[  420], 99.95th=[  519],
     | 99.99th=[  906]
   bw (  KiB/s): min=957952, max=960128, per=100.00%, avg=959040.00, stdev=1538.66, samples=2
   iops        : min=14968, max=15002, avg=14985.00, stdev=24.04, samples=2
  lat (usec)   : 100=8.45%, 250=49.13%, 500=42.36%, 750=0.04%, 1000=0.02%
  cpu          : usr=10.92%, sys=33.39%, ctx=8628, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16384,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
  WRITE: bw=931MiB/s (976MB/s), 931MiB/s-931MiB/s (976MB/s-976MB/s), io=1024MiB (1074MB), run=1100-1100msec

Disk stats (read/write):
  sda: ios=46/13297, merge=0/0, ticks=4/2928, in_queue=2932, util=90.93%